name: "yolo_classifier_pretrain"
layer {
  name: "pascal"
  type: "Data"
  top: "data"
  top: "labels"
  include {
    phase: TRAIN
  }
  data_param {
    source: "pascal_train_lmdb"
    batch_size: 8
    labels_number: 20
    backend: LMDB
  }
  transform_param {
    scale: 0.00390625 
  }
}
layer {
  name: "pascal"
  type: "Data"
  top: "data"
  top: "labels"
  include {
    phase: TEST
  }
  data_param {
    source: "pascal_val_lmdb"
    batch_size: 8
    labels_number: 20
    backend: LMDB
  }
  transform_param {
    scale: 0.00390625 
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv4"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "pool3"
  top: "conv5"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv5"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv6"
  type: "Convolution"
  bottom: "pool4"
  top: "conv6"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv6"
  top: "conv6"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "conv7"
  type: "Convolution"
  bottom: "conv6"
  top: "conv7"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv7"
  top: "conv7"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "conv8"
  type: "Convolution"
  bottom: "conv7"
  top: "conv8"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu8"
  type: "ReLU"
  bottom: "conv8"
  top: "conv8"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "conv8"
  top: "ip1"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ip2-1"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-1"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-2"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-3"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-3"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-4"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-4"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-5"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-5"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-6"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-6"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-7"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-7"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-8"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-8"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-9"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-9"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-10"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-10"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-11"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-11"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-12"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-12"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-13"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-13"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-14"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-14"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-15"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-15"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-16"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-16"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-17"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-17"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-18"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-18"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-19"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-19"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "ip2-20"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2-20"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "loss"
  type: "YoloPretrainedLoss"
  bottom: "labels"
  bottom: "ip2-1"
  bottom: "ip2-2"
  bottom: "ip2-3"
  bottom: "ip2-4"
  bottom: "ip2-5"
  bottom: "ip2-6"
  bottom: "ip2-7"
  bottom: "ip2-8"
  bottom: "ip2-9"
  bottom: "ip2-10"
  bottom: "ip2-11"
  bottom: "ip2-12"
  bottom: "ip2-13"
  bottom: "ip2-14"
  bottom: "ip2-15"
  bottom: "ip2-16"
  bottom: "ip2-17"
  bottom: "ip2-18"
  bottom: "ip2-19"
  bottom: "ip2-20"
  top: "loss"
  propagate_down:false
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  propagate_down:true
  include {
    phase: TRAIN
  }
}
layer {
  name: "accuray"  
  type: "YoloPreTrainAccuracy"
  bottom: "labels"
  bottom: "ip2-1"
  bottom: "ip2-2"
  bottom: "ip2-3"
  bottom: "ip2-4"
  bottom: "ip2-5"
  bottom: "ip2-6"
  bottom: "ip2-7"
  bottom: "ip2-8"
  bottom: "ip2-9"
  bottom: "ip2-10"
  bottom: "ip2-11"
  bottom: "ip2-12"
  bottom: "ip2-13"
  bottom: "ip2-14"
  bottom: "ip2-15"
  bottom: "ip2-16"
  bottom: "ip2-17"
  bottom: "ip2-18"
  bottom: "ip2-19"
  bottom: "ip2-20"
  top: "accuracy"
  include {
    phase: TEST
  }
  yolo_pretrain_accuracy_param {
    error: 0.5
  }
}
